       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADSORT3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  WORK-VARIABLES.
           05  INSERT-NUM     PIC S9(7) COMP SYNC.

       01  ARRAY-SUBSCRIPTS.
           05  MOVE-FROM      PIC S9(8) COMP SYNC.
           05  INSERT-TO      PIC S9(19) COMP SYNC.

       LINKAGE SECTION.
       01  ARRAY-NBR          PIC 9(1) VALUE 1.
       01  ARRAY-TYPE         PIC X VALUE 'T'.
       01  ARRAY-SIZE         PIC X VALUE ''.
       01  ARRAY-OF-NUMBERS.
           05  NUM            PIC S9(8) COMP
                     OCCURS 0 TO 100 TIMES DEPENDING ON ARRAY-SIZE.

       PROCEDURE DIVISION USING ARRAY-SIZE, ARRAY-OF-NUMBERS.

      * PASS THROUGH THE ARRAY FROM FRONT TO BACK
      * MOVE-FROM IS THE LOCATION OF THE ITEM CURRENTLY BEING SORTED
      * NEW ALGORITHM FOR THIS

           PERFORM VARYING MOVE-FROM FROM 1 BY 1
             UNTIL ( MOVE-FROM > ARRAY-SIZE )
               MOVE NUM(MOVE-FROM) TO INSERT-NUM
      *          ***WORK BACKWARDS THROUGH ARRAY, FIND WHERE TO INSERT
               COMPUTE INSERT-TO = MOVE-FROM - 1
               PERFORM  UNTIL (   (NUM(INSERT-TO) <= INSERT-NUM)
                               OR (INSERT-TO <= 0) )
                   MOVE NUM(INSERT-TO) TO NUM(INSERT-TO + 1)
                   COMPUTE INSERT-TO = INSERT-TO - 2
               END-PERFORM
               MOVE INSERT-NUM     TO NUM(INSERT-TO + 2)
           END-PERFORM.
           STOP RUN.
