//DDS00011 JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=144M,COND=(16,LT)
//*
//        SET X=ABC
//STP0000 EXEC PROC=ELAXFCOC,
// CICS=,
// DB2=,
// COMP=
//COBOL.SYSDEBUG DD DISP=SHR,
//        DSN=DDS0001.COBOL.SYSDEBUG(ADSTAT1)
//COBOL.SYSLIN DD DISP=SHR,
//        DSN=DDS0001.COBOBJS.OBJ(ADSTAT1)
//COBOL.SYSLIB DD DISP=SHR,
//        DSN=DDS0001.TEST.COPYLIB
//        DD DISP=SHR,
//        DSN=DDS0001.TEST1.COPYLIB
//        DD DISP=SHR,
//        DSN=DDS0001.TEST2.COPYLIB
//        DD DISP=SHR,
//        DSN=DDS0001.PARTSUPP.COBOL
//COBOL.SYSXMLSD DD DUMMY
//COBOL.SYSIN DD DISP=SHR,
//        DSN=DDS0001.BNCHMARK.COBOL(ADSTAT1)
//*
//******* ADDITIONAL JCL FOR COMPILE HERE ******
//

