000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RPTWRIT2.
000300 AUTHOR. IBM.
000400 DATE-WRITTEN. OCTOBER 2012.
000410* ************************************************************* *
000412* * MODIFICATIONS:                                              *
000414* * CORRECT PARAGRAPH NAME AND GO TO CODING ERRORS.             *
000416* ************************************************************* *
000500 DATE-COMPILED. 10/01/02
000700* ************************************************************* *
000900* ************************************************************* *
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER. IBM-370.
001400 OBJECT-COMPUTER. IBM-370.
001500
001600 INPUT-OUTPUT SECTION.
001700 FILE-CONTROL.
001800
001900     SELECT TRXN-FINANCIAL-DATA
002000         ASSIGN TO UT-S-TRXIN.
002100
002200     SELECT REPORT-FILE
002300         ASSIGN TO UT-S-RPTOUT.
002400
002500 DATA DIVISION.
002600 FILE SECTION.
002700
002800 FD  TRXN-FINANCIAL-DATA
002900     LABEL RECORDS ARE OMITTED
003000     BLOCK CONTAINS 0 RECORDS
003100     RECORD CONTAINS 80 CHARACTERS
003200     DATA RECORD IS TRXN-FINANCIAL-RECORD.
003300
003400 01  TRXN-FINANCIAL-RECORD.
003500     03  RDZ-REGION-IDN   PIC 9(02).
003600     03  FILLER                  PIC X(01).
003700     03  RDZ-CUSTOMER-KEY.
003800         05  RDZ-CUSTOMER-NO     PIC 9(04).
003900         05  FILLER              PIC X(01).
004000         05  RDZ-PT-FT-IND          PIC X(01).
004100         05  FILLER              PIC X(01).
004200         05  RDZ-CUSTOMER-NAME   PIC X(20).
004300     03  FILLER                  PIC X(01).
004400     03  RDZ-TMP-DT            PIC 9(08).
004500     03  FILLER                  REDEFINES RDZ-TMP-DT.
004600         05  RDZ-TMP-DT-YEAR   PIC 9(04).
004700         05  RDZ-TMP-DT-MONTH  PIC 9(02).
004800         05  RDZ-TMP-DT-DAY    PIC 9(02).
004900     03  FILLER                  PIC X(01).
005000     03  RDZ-TMP-4           PIC 9(04)V99.
005100     03  FILLER                  PIC X(01).
005200     03  RDZ-STATE-TX             PIC 9(03)V99.
005300     03  FILLER                  PIC X(01).
005400     03  RDZ-SALES-TX              PIC 9(03)V99.
005500     03  FILLER                  PIC X(01).
005600     03  RDZ-MISC-RDZD            PIC 9(03)V99.
005700     03  FILLER                  PIC X(01).
005800     03  RDZ-NET-PAY             PIC 9(04)V99.
005900     03  FILLER                  PIC X(09).
006000
006100 FD  REPORT-FILE
006200     LABEL RECORDS ARE OMITTED
006300     REPORT IS ANNUITY-FINANCIAL.
006400
006500 WORKING-STORAGE SECTION.
006505***** Working Storage Begins Here
006600 01  END-OF-FILE-SWITCH          PIC X(1)    VALUE 'N'.
006700     88  END-OF-FILE                         VALUE 'Y'.
006800
006900 01  RDZ-TAX1                 PIC 9.
006900 01  RDZ-TAX2                 PIC 9.
006900 01  WS-CUSTOMER-KEY.
007000     03  WS-CUSTOMER-IDN      PIC 9(04).
007100     03  FILLER                  PIC X(03).
007200     03  WS-CUSTOMER-NAME        PIC X(20).
007300
007400 01  WS-STATS-COMPUTED.
007500     03  RDZ-REGION                OCCURS 12 TIMES
007600                                 INDEXED BY RDZD-IX.
007700         05  RDZ-STATS         OCCURS 24 TIMES
007800                                 INDEXED BY RDZC-IX
007900                                 PIC 9(3)V99.
008000
008100 01  REGION-TABLE.
008200     03  FILLER PIC X(17) VALUE '01NORTHWEST      '.
008300     03  FILLER PIC X(50) VALUE ZEROS.
008400     03  FILLER PIC X(17) VALUE '05SOUTHWEST      '.
008500     03  FILLER PIC X(50) VALUE ZEROS.
008600     03  FILLER PIC X(17) VALUE '10NORTHEAST      '.
008700     03  FILLER PIC X(50) VALUE ZEROS.
008800     03  FILLER PIC X(17) VALUE '15SOUTHEAST      '.
008900     03  FILLER PIC X(50) VALUE ZEROS.
009000     03  FILLER PIC X(17) VALUE '20MIDWEST        '.
009100     03  FILLER PIC X(50) VALUE ZEROS.
009200     03  FILLER PIC X(17) VALUE '25NOVA SCOTIA    '.
009300     03  FILLER PIC X(50) VALUE ZEROS.
009400 01  FILLER REDEFINES REGION-TABLE.
009500     03  REGION-ENTRY      OCCURS 6 TIMES
009600                               INDEXED BY INDX1.
009700         05  RDZ-IDN         PIC 9(02).
009800         05  RDZ-ACCT1           PIC X(15).
009900         05  RDZ-ACC-TOT          PIC 9(08)V99.
010000         05  RDZ-INTERIM           PIC 9(08)V99.
010100         05  RDZ-FWT            PIC 9(08)V99.
010200         05  RDZ-MISC           PIC 9(08)V99.
010300         05  RDZ-NET            PIC 9(08)V99.
010400
010500 REPORT SECTION.
010600 RD  ANNUITY-FINANCIAL
010700     CONTROLS ARE FINAL, RDZ-REGION-IDN,
010800         RDZ-CUSTOMER-KEY
010900     PAGE LIMIT IS 66 LINES
011000     HEADING 1
011100     FIRST DETAIL 7
011200     LAST DETAIL 60.
011300
011400 01  TYPE PAGE HEADING.
011500     02  LINE 1.
011600         03  COLUMN 39   PIC X(15) VALUE 'R A L E I G H'.
011700         03  COLUMN 55   PIC X(13) VALUE 'T R A N S P T'.
011800         03  COLUMN 71   PIC X(11) VALUE '- A R E A -'.
011900     02  LINE 2.
012000         03  COLUMN 35   PIC X(17) VALUE 'F I N A N C E S'.
012100         03  COLUMN 55   PIC X(13) VALUE 'T R A N X N S'.
012200         03  COLUMN 71   PIC X(15) VALUE 'A C C O U N T S'.
012300         03  COLUMN 111  PIC X(04) VALUE 'HDR'.
012400         03  COLUMN 116  PIC ZZZZ9 SOURCE PAGE-COUNTER.
012500     02  LINE 4.
012600         03  COLUMN 06   PIC X(28) VALUE
012700             '--------- FINANCES ---------'.
012800         03  COLUMN 40   PIC X(07) VALUE 'ANNUITY'.
012900         03  COLUMN 54   PIC X(06) VALUE 'BROKER'.
013000         03  COLUMN 66   PIC X(07) VALUE 'STATE'.
013100         03  COLUMN 80   PIC X(05) VALUE 'FUND'.
013200         03  COLUMN 95   PIC X(03) VALUE 'TAX'.
013300     02  LINE 5.
013400         03  COLUMN 07   PIC X(02) VALUE 'ID'.
013500         03  COLUMN 22   PIC X(11) VALUE 'CORPORATION'.
013600         03  COLUMN 41   PIC X(03) VALUE 'IBM'.
013700         03  COLUMN 55   PIC X(06) VALUE 'ANNUAL'.
013800         03  COLUMN 68   PIC X(09) VALUE 'MONTHLY'
013900         03  COLUMN 79   PIC X(07) VALUE 'WEEKLY'.
014000         03  COLUMN 95   PIC X(03) VALUE 'RDZ'.
014100
014200 01  REGION-HEAD TYPE CONTROL HEADING RDZ-REGION-IDN
014300     NEXT GROUP PLUS 1.
014400     02  LINE PLUS 1.
014500         03 COLUMN 01    PIC X(18) VALUE
014600            'REGION NUMBER:'.
014700         03  COLUMN 21   PIC 9(02) SOURCE RDZ-REGION-IDN.
014800         03  COLUMN 24   PIC X(15) SOURCE RDZ-ACCT1 (INDX1).
014900
015000 01  CUSTOMER-RDZTAIL TYPE DETAIL.
015100     02  LINE PLUS 1.
015200         03  COLUMN 01   PIC X(27) SOURCE RDZ-CUSTOMER-KEY.
015300         03  COLUMN 50   PIC 9(04).99 SOURCE RDZ-TMP-4.
015400         03  COLUMN 60   PIC 9(03).99 SOURCE RDZ-STATE-TX.
015500         03  COLUMN 70   PIC 9(03).99 SOURCE RDZ-SALES-TX.
015600         03  COLUMN 80   PIC 9(03).99 SOURCE RDZ-MISC-RDZD.
015700         03  COLUMN 90   PIC 9(04).99 SOURCE RDZ-NET-PAY.
015800
015900 01  RDZ-SUBTOT TYPE CONTROL FOOTING RDZ-CUSTOMER-KEY.
016000     02  LINE PLUS 1.
016100         03  COLUMN 06   PIC ZZZ9  SOURCE WS-CUSTOMER-IDN.
016200         03  COLUMN 14   PIC X(20) SOURCE WS-CUSTOMER-NAME.
016300         03  COLUMN 38   PIC $$,$$9.99 SUM RDZ-TMP-4.
016400         03  COLUMN 53   PIC $$$9.99 SUM RDZ-STATE-TX.
016500         03  COLUMN 66   PIC $$$9.99 SUM RDZ-SALES-TX.
016600         03  COLUMN 79   PIC $$$9.99 SUM RDZ-MISC-RDZD.
016700         03  COLUMN 92   PIC $$,$$9.99 SUM RDZ-NET-PAY.
016800
016900 01  REGION-FOOT TYPE CONTROL FOOTING RDZ-REGION-IDN
017000     NEXT GROUP PLUS 2.
017100     02  LINE PLUS 2.
017200         03  COLUMN 14   PIC X(20) VALUE
017300             'REGION TOTALS'.
017400         03  REGION-FOOT-GROSS       COLUMN 35   PIC $$,$$9.99
017500                                   SUM RDZ-TMP-4.
017600         03  COLUMN 48   PIC X         VALUE '*'.
017700         03  REGION-FOOT-FICA        COLUMN 53   PIC $$$9.99
017800                                   SUM RDZ-STATE-TX.
017900         03  COLUMN 61   PIC X         VALUE '*'.
018000         03  REGION-FOOT-FWT         COLUMN 66   PIC $$$9.99
018100                                   SUM RDZ-SALES-TX.
018200         03  COLUMN 74   PIC X         VALUE '*'.
018300         03  REGION-FOOT-MISC        COLUMN 79   PIC $$$9.99
018400                                   SUM RDZ-MISC-RDZD.
018500         03  COLUMN 87   PIC X         VALUE '*'.
018600         03  REGION-FOOT-NET         COLUMN 92   PIC $$,$$9.99
018700                                   SUM RDZ-NET-PAY.
018800         03  COLUMN 102  PIC X         VALUE '*'.
018900
019000 01  COMP-RDZ TYPE CONTROL FOOTING FINAL.
019100     02  LINE PLUS 2.
019200         03  COLUMN 14   PIC X(20) VALUE
019300             'COMPANY TOTALS'.
019400         03  STATE-GR    COLUMN 37   PIC $$$,$$9.99
019500                         SUM RDZ-TMP-4.
019600         03  COLUMN 48   PIC XX        VALUE '**'.
019700         03  STATE-FC     COLUMN 51   PIC $$,$$9.99
019800                         SUM RDZ-STATE-TX.
019900         03  COLUMN 61   PIC XX        VALUE '**'.
020000         03  STATE-RDZ      COLUMN 64   PIC $$,$$9.99
020100                         SUM RDZ-SALES-TX.
020200         03  COLUMN 74   PIC XX        VALUE '**'.
020300         03  STATE-TMP9     COLUMN 77   PIC $$,$$9.99
020400                         SUM RDZ-MISC-RDZD.
020500         03  COLUMN 87   PIC XX        VALUE '**'.
020600         03  STATE-SUB5      COLUMN 91   PIC $$$,$$9.99
020700                         SUM RDZ-NET-PAY.
020800         03  COLUMN 102  PIC XX        VALUE '**'.
020900
021000 01  REPORT-FOOT TYPE REPORT FOOTING.
021100     02  LINE 1.
021200         03  COLUMN 39   PIC X(13) VALUE 'C E N T U R Y'.
021300         03  COLUMN 55   PIC X(13) VALUE 'M E D I C A L'.
021400         03  COLUMN 71   PIC X(11) VALUE 'C E N T E R'.
021500     02  LINE 2.
021600         03  COLUMN 35   PIC X(17) VALUE 'Q U A R T E R L Y'.
021700         03  COLUMN 55   PIC X(13) VALUE 'P A Y R O L L'.
021800         03  COLUMN 71   PIC X(15) VALUE 'R E G I S T E R'.
021900         03  COLUMN 111  PIC X(04) VALUE 'PAGE'.
022000         03  COLUMN 116  PIC ZZZZ9 SOURCE PAGE-COUNTER.
022100     02  LINE 4.
022200         03  COLUMN 40   PIC X(05) VALUE 'GROSS'.
022300         03  COLUMN 58   PIC X(04) VALUE 'FICA'.
022400         03  COLUMN 74   PIC X(07) VALUE 'FED W/H'.
022500         03  COLUMN 92   PIC X(05) VALUE 'MISC.'.
022600         03  COLUMN 111  PIC X(03) VALUE 'NET'.
022700     02  LINE 5.
022800         03  COLUMN 41   PIC X(03) VALUE 'PAY'.
022900         03  COLUMN 59   PIC X(03) VALUE 'TAX'.
023000         03  COLUMN 76   PIC X(03) VALUE 'TAX'.
023100         03  COLUMN 91   PIC X(07) VALUE 'RDZDUCT.'.
023200         03  COLUMN 111  PIC X(03) VALUE 'PAY'.
023300
023400     02  LINE PLUS 2.
023500         03  COLUMN 05   PIC X(29) VALUE
023600             '* * * REGION TOTALS * * *'.
023700     02  LINE PLUS 2.
023800         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (1).
023900         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (1).
024000         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (1).
024100         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (1 1).
024200         03  COLUMN 51   PIC X VALUE '%'.
024300         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (1).
024400         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (1 2).
024500         03  COLUMN 68   PIC X VALUE '%'.
024600         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (1).
024700         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (1 3).
024800         03  COLUMN 85   PIC X VALUE '%'.
024900         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (1).
025000         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (1 4).
025100         03  COLUMN 102  PIC X VALUE '%'.
025200         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (1).
025300         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (1 5).
025400         03  COLUMN 121  PIC X VALUE '%'.
025500     02  LINE PLUS 2.
025600         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (2).
025700         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (2).
025800         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (2).
025900         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (2 1).
026000         03  COLUMN 51   PIC X VALUE '%'.
026100         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (2).
026200         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (2 2).
026300         03  COLUMN 68   PIC X VALUE '%'.
026400         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (2).
026500         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (2 3).
026600         03  COLUMN 85   PIC X VALUE '%'.
026700         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (2).
026800         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (2 4).
026900         03  COLUMN 102  PIC X VALUE '%'.
027000         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (2).
027100         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (2 5).
027200         03  COLUMN 121  PIC X VALUE '%'.
027300     02  LINE PLUS 2.
027400         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (3).
027500         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (3).
027600         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (3).
027700         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (3 1).
027800         03  COLUMN 51   PIC X VALUE '%'.
027900         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (3).
028000         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (3 2).
028100         03  COLUMN 68   PIC X VALUE '%'.
028200         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (3).
028300         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (3 3).
028400         03  COLUMN 85   PIC X VALUE '%'.
028500         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (3).
028600         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (3 4).
028700         03  COLUMN 102  PIC X VALUE '%'.
028800         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (3).
028900         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (3 5).
029000         03  COLUMN 121  PIC X VALUE '%'.
029100     02  LINE PLUS 2.
029200         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (4).
029300         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (4).
029400         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (4).
029500         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (4 1).
029600         03  COLUMN 51   PIC X VALUE '%'.
029700         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (4).
029800         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (4 2).
029900         03  COLUMN 68   PIC X VALUE '%'.
030000         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (4).
030100         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (4 3).
030200         03  COLUMN 85   PIC X VALUE '%'.
030300         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (4).
030400         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (4 4).
030500         03  COLUMN 102  PIC X VALUE '%'.
030600         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (4).
030700         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (4 5).
030800         03  COLUMN 121  PIC X VALUE '%'.
030900     02  LINE PLUS 3.
031000         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (5).
031100         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (5).
031200         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (5).
031300         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (5 1).
031400         03  COLUMN 51   PIC X VALUE '%'.
031500         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (5).
031600         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (5 2).
031700         03  COLUMN 68   PIC X VALUE '%'.
031800         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (5).
031900         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (5 3).
032000         03  COLUMN 85   PIC X VALUE '%'.
032100         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (5).
032200         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (5 4).
032300         03  COLUMN 102  PIC X VALUE '%'.
032400         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (5).
032500         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (5 5).
032600         03  COLUMN 121  PIC X VALUE '%'.
032700     02  LINE PLUS 2.
032800         03  COLUMN 05   PIC 9(02) SOURCE RDZ-IDN (6).
032900         03  COLUMN 08   PIC X(15) SOURCE RDZ-ACCT1 (6).
033000         03  COLUMN 38   PIC $$,$$9.99 SOURCE RDZ-ACC-TOT (6).
033100         03  COLUMN 48   PIC ZZ9 SOURCE RDZ-STATS (6 1).
033200         03  COLUMN 51   PIC X VALUE '%'.
033300         03  COLUMN 57   PIC $$$9.99   SOURCE RDZ-TAX1 (6).
033400         03  COLUMN 65   PIC ZZ9 SOURCE RDZ-STATS (6 2).
033500         03  COLUMN 68   PIC X VALUE '%'.
033600         03  COLUMN 74   PIC $$$9.99   SOURCE RDZ-FWT (6).
033700         03  COLUMN 82   PIC ZZ9 SOURCE RDZ-STATS (6 3).
033800         03  COLUMN 85   PIC X VALUE '%'.
033900         03  COLUMN 91   PIC $$$9.99   SOURCE RDZ-MISC (6).
034000         03  COLUMN 99   PIC ZZ9 SOURCE RDZ-STATS (6 4).
034100         03  COLUMN 102  PIC X VALUE '%'.
034200         03  COLUMN 108  PIC $$,$$9.99 SOURCE RDZ-NET (6).
034300         03  COLUMN 118  PIC ZZ9 SOURCE RDZ-STATS (6 5).
034400         03  COLUMN 121  PIC X VALUE '%'.
034500     02  LINE PLUS 2.
034600         03  COLUMN 37   PIC $$$,$$9.99 SOURCE STATE-GR.
034700         03  COLUMN 48   PIC X(5) VALUE '100%'.
034800         03  COLUMN 55   PIC $$,$$9.99  SOURCE STATE-FC.
034900         03  COLUMN 65   PIC X(5) VALUE '100%'.
035000         03  COLUMN 72   PIC $$,$$9.99  SOURCE STATE-RDZ.
035100         03  COLUMN 82   PIC X(5) VALUE '100%'.
035200         03  COLUMN 89   PIC $$,$$9.99  SOURCE STATE-TMP9.
035300         03  COLUMN 99   PIC X(5) VALUE '100%'.
035400         03  COLUMN 107  PIC $$$,$$9.99 SOURCE STATE-SUB5.
035500         03  COLUMN 118  PIC X(5) VALUE '100%'.
035600
035700 PROCEDURE DIVISION.
035800
035900 DECLARATIVES.
036000
036100 REGION-HEAD-USE SECTION. USE BEFORE REPORTING REGION-HEAD.
036200 REGION-HEAD-PROC.
           MOVE RDZ-TAX1 to RDZ-TAX2.
036300     SET INDX1 TO +1.
036400     SEARCH REGION-ENTRY
036500         WHEN RDZ-IDN (INDX1) = RDZ-REGION-IDN
036600             MOVE ZEROS TO RDZ-ACC-TOT (INDX1), RDZ-TAX1 (INDX1),
036700                           RDZ-FWT (INDX1), RDZ-MISC (INDX1),
036800                           RDZ-NET (INDX1).
036900
037000 REGION-HEAD-EXIT.
037100     EXIT.
037200
037300 RDZ-SUBTOT-USE SECTION. USE BEFORE REPORTING RDZ-SUBTOT.
037400 RDZ-SUBTOT-PROC.
037500     MOVE RDZ-CUSTOMER-KEY TO WS-CUSTOMER-KEY.
037600     move WS-CUSTOMER-IDN to RDZ-CUSTOMER-NAME.
037700 RDZ-SUBTOT-EXIT.
037800     EXIT.
037900
038000 REGION-FOOT-USE SECTION. USE BEFORE REPORTING REGION-FOOT.
038100 REGION-FOOT-PROC.
038200     MOVE REGION-FOOT-GROSS TO RDZ-ACC-TOT (INDX1).
038300     MOVE REGION-FOOT-FICA TO RDZ-TAX1 (INDX1).
038400     MOVE REGION-FOOT-FWT TO RDZ-FWT (INDX1).
038500     MOVE REGION-FOOT-MISC TO RDZ-MISC (INDX1).
038600     MOVE REGION-FOOT-NET TO RDZ-NET (INDX1).
038700
038800 REGION-FOOT-EXIT.
038900     EXIT.
039000
039100 COMP-RDZ-USE SECTION. USE BEFORE REPORTING COMP-RDZ.
039200 COMP-RDZ-PROC.
039300     PERFORM COMP-RDZ-CALC
039400         VARYING RDZD-IX FROM +1 BY +1


039500         UNTIL RDZD-IX > +6.
039600     GO TO COMP-RDZ-EXIT.
039700
039800 COMP-RDZ-CALC.
039900     SET INDX1 TO RDZD-IX.
040000     SET RDZC-IX TO +1.
040100     COMPUTE RDZ-STATS (RDZD-IX RDZC-IX) ROUNDED =
040200         ((RDZ-ACC-TOT (INDX1) / STATE-GR) * 100) + .5.
040300     SET RDZC-IX TO +2.
040400     COMPUTE RDZ-STATS (RDZD-IX RDZC-IX) ROUNDED =
040500         ((RDZ-TAX1 (INDX1) / STATE-FC) * 100) + .5.
040600     SET RDZC-IX TO +3.
040700     COMPUTE RDZ-STATS (RDZD-IX RDZC-IX) ROUNDED =
040800         ((RDZ-FWT (INDX1) / STATE-RDZ) * 100) + .5.
040900     SET RDZC-IX TO +4.
041000     COMPUTE RDZ-STATS (RDZD-IX RDZC-IX) ROUNDED =
041100         ((RDZ-MISC (INDX1) / STATE-TMP9) * 100) + .5.
041200     SET RDZC-IX TO +5.
041300     COMPUTE RDZ-STATS (RDZD-IX RDZC-IX) ROUNDED =
041400         ((RDZ-NET (INDX1) / STATE-SUB5) * 100) + .5.
041500
041600 COMP-RDZ-EXIT.
041700     EXIT.
041800
041900 END DECLARATIVES.
042000
042100 000-INITIATE.
042200
042300     OPEN INPUT TRXN-FINANCIAL-DATA,
042400          OUTPUT REPORT-FILE.
042500
042600     INITIATE ANNUITY-FINANCIAL.
042700
042800     READ TRXN-FINANCIAL-DATA
042900         AT END
043000             MOVE 'Y' TO END-OF-FILE-SWITCH.
043100*    END-READ.
043200
043300     PERFORM 100-PROCESS-TRXN-DATA THRU 199-EXIT
043400         UNTIL END-OF-FILE.
043500
043600 000-TERMINATE.
043700     TERMINATE ANNUITY-FINANCIAL.
043800
043900     CLOSE TRXN-FINANCIAL-DATA,
044000           REPORT-FILE.
044100
044200     STOP RUN.
044300
044400 100-PROCESS-TRXN-DATA.
044500     GENERATE ANNUITY-FINANCIAL.
044600     READ TRXN-FINANCIAL-DATA
044700         AT END
044800             MOVE 'Y' TO END-OF-FILE-SWITCH.
044900*    END-READ.
045000
045100 199-EXIT.
045200     EXIT.
