000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.   TEST01.
003200*
003300 INSTALLATION.  IBM.
003400 DATE-WRITTEN.  01-01-2009.
003500 DATE-COMPILED. 01-01-2009.
003600 SECURITY.   NONE.
003700 ENVIRONMENT DIVISION.
003800 CONFIGURATION SECTION.
003900 SOURCE-COMPUTER.   IBM.
004000 OBJECT-COMPUTER.   IBM.
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004500 DATA DIVISION.
004600 FILE SECTION.
007000 WORKING-STORAGE SECTION.
       01  INTERFACE-AREA.
           05 L-INPUT-LENGTH    PIC 9(4) COMP VALUE 8.
           05 L-INPUT-DATE.
             10 L-CCYY  PIC X(4) VALUE '2016'.
             10 L-MM    PIC X(2) VALUE '01'.
             10 L-DD    PIC X(2) VALUE '01'.
      *
010100 PROCEDURE DIVISION.
010200 000-TOP-LEVEL.
010300     CALL 'EBUD01' USING INTERFACE-AREA.
010300     CALL 'EBUDP1' USING BY CONTENT L-INPUT-DATE.
010600     GOBACK.
